Autodesk.Revit.UI.PostableCommand.UseConceptualMassesForSimulation
Sets conceptual masses as the basis for generating the energy analytical model used for energy simulation.

Autodesk.Revit.UI.PostableCommand.UseBuildingElementsForSimulation
Sets building elements as the basis for generating the energy analytical model used for energy simulation.

Autodesk.Revit.UI.PostableCommand.EnableEnergyModel
Toggles the creation of energy analytical model geometry and parameters.

Autodesk.Revit.UI.PostableCommand.RunEnergySimulation
Subscription-Only Feature. Sends energy model geometry and parameters to Autodesk Green Building Studio for simulation.

Autodesk.Revit.UI.PostableCommand.EnergySettings
Specifies energy-related data and parameters used to define the energy analytical model.